ebirger/tinkerpal/drivers/net/js_esp8266.c
/* Copyright (c) 2013, Eyal Birger
 * All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * The name of the author may not be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL <COPYRIGHT HOLDER> BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
 * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#include "js/js_obj.h"
#include "js/js_utils.h"
#include "js/js_event.h"
#include "js/jsapi_decl.h"
#include "net/js_netif.h"
#include "drivers/net/esp8266.h"
#include "boards/board.h"

int do_esp8266_constructor(obj_t **ret, obj_t *this, int argc, obj_t *argv[])
{
    esp8266_params_t params;
    const esp8266_params_t *p = &params;
    netif_t *netif;
    event_t *e;
    int rc;

    if (argc == 1)
        return js_invalid_args(ret);

    if (!is_function(argv[1]))
        return throw_exception(ret, &S("Invalid callback"));

    if (argc < 3)
        p = &board.esp8266_params;
    else
    {
        params.serial_port = obj_get_int(argv[2]);
        params.echo_on = 0;
    }

    netif = esp8266_new(p);

    if ((rc = netif_obj_constructor(netif, ret, this, argc, argv)))
        return rc;

    e = js_event_new(argv[1], *ret, js_event_gen_trigger);
    event_watch_set_once(NETIF_RES(netif, NETIF_EVENT_READY), e);
    return 0;
}
